{"/aboutme/":{"data":{"":"","who-am-i#Who am I":"Well, although it is kind of silly to define oneself, I am an INFJ, a Master’s student who want to keep exploring AI as a researcher, and a gamer. But most importantly, to answer “who am I” , is up to you:\nFor potential employers, recuiters, and professors I am looking for a PhD program in the next three years. And I am also open to internships in AI research. If you are interested in my research, please contact me by email: doby-xu@outlook.com and I will be happy to send my latest CV.\nMy advisors tend to describe me as independent-minded, creative, suck at writing, but I prefer to describe myself as a person who keeps a tight schedule and is always curious about the world.\nCheck out my work on the permutation equivariance of Transformers and its applications. I mathematically formulated, extended and proved the permutation equivariance of Transformers in both row-wise and column-wise, in both forward and backward passes.\nMy Work Accepted by CVPR'24!Permutation Equivariance of Transformer For my peers and fellow researchers I am a shy boy but I am always open to collaborations and discussions. No matter what you are interested in, like how to verify the permutation equivariance of Transformers, or how to beat Malenia, I am always happy to discuss with you.\nAnd also, my blogs would also be potentially helpful to you if you are trying to read my papers.\nFor junior students Although I am not one of the top graduate students in my cohort, I still got some experience to share. My experience is highly specialized in how to apply for a Master’s program in China, and how to survive an alone acadamic journey to the west, so switch to my Chinese page if you are interested in that (the switch button is on the bottom left corner)."},"title":"About Me"},"/research/":{"data":{"":"Here are all my research work.\n⚠️ Warning: This page is still under construction. "},"title":"Research"},"/research/cvpr24/":{"data":{"":" ⚠️ Warning: This page is still under construction. "},"title":"Permutation Equivariance"}}